node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1801889
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\312p\323\275\375\002\304=.7\242\275\300>\254\275\t6\345\275\314i\034\276\267_\340\275\255\350\026\276\232+\266\271J7\261\275\252\177\251<Z\026\014\276\004Uc\276\236\304P=\372\302\355<\276\365#>\355Y0=\000L\211\276\3706\\>\354z\020>S\225\213<\227\316\357;\340\345\010>\177(\357<\251:\">u_\005\276\022P\241=\205\351\261=p\362\235=\230\270\023>\035V:\276t;E\276\260*\203<|\306\235\275\225\243\331<K\217\246\273\366S\332=Rm,>|\246W\276w\225\026\276N\364\0349(F\324<4\003%\275\315\036p\276\336?\312=\334\212Y>\361|\'\276G\266\253\275T\200\250>nh\'=\353\213\035>\351\'\274\275C\225\250\275\t\2672>W|\215\275\\kt=\302;\302;\207\022\005\276\247q\245\274\376>\005\276;\220&=}\360\201\273\261\275\271\275w\3642\275i\331V\275\220\212G>\'\001\233\275\254\2705\275\"zs> ,*>\260@n=\203\033\355\275\021\355\032>1\312\210>k\247\315<\375\350\021\276\263.[>\372t>>\262P\217;\177C`=\253%\345<\202\364\027>q\022s\275\225\266\300\274:\365\303>F\004&=\035\023x>R\020\245\275\302\363\'\274\213\271\020=\220|\023\276\203&\203>\261\233\032>\375\315d\273\232\200\310\275\333\330\315\272\263=E=\273\374\201=\366\370o\274\0044\261\273\330;\372\273gG\206;<ah;\025fH=;/\253\275\003\226-<woJ=\314\036T=\254\253\177>\245\334\306\274uSV>^\273\032>\200<t>\254)\213\275\221{\n=\347\014\352=31\365\275eO=>\265\330U\275\303\262;=\260\201\205>p\302\007>\232YK<Y:\000\275v\020\337\274\376\342\201\276\020\372K\275U\304\326=\016\236\214>!!d=\231\266\222\273\331\341\221\276\355\356\271=\213\326\260=z\366{>NC\355\275\323\205\004>\352\006\005\275O\311\210=xu\323\275U\253y=\0103\301\275\347\361q\275\010~,\275\353\377\020=1\361\270\275\223\031\003<;\352\274=\016\246\211=\227N\361\275\203W\320=\315%\273\275\272\261d\276h\237\335\274\265\205\202<>\010_\275\350r\257\275\307\"1=\350\216?>U&\030>6G;\276rUL\275\207)b\275\372\256*>:\002\347=\235\250\365\275\243\377l\276\333\232U\273=\237H\274\352\306A<P\271x=\002\020\311\276 \274m=\035\361\234=\224N\343=%\004\201\275\362\361\245\275`\000\253\275\226\203\020:\301\232\367=q >\276\345\255J\275\224.6>t\265 >\210Z\244=\320J\270\275\035\023\007>\202\354d\276@\2469\275/\376\024\276ZO9=\252\242\264<\266\254\323;n\250\275=Q+M\275{\366,\276}3\340\275\023/;=\344]\005\276\366h\200>\341\263\322=\217z\204=\320\255\001\2765\321\000>\311\341\000>\353\017T=xX\013>\247\212\344=\357\337\334;\204[\305=\371\307p>\3045\204\274B\r\356\272UFQ\276ZE\226=\002\255\201>U%&\275\236\3645>\335\265\235<\212_\004=\343]R\276\313\257\256<R\3317\276\266\020\037>H\351~>U\0233\275:\314\257\275\234\222\234<\204D\005=\032\356\200\273`\021|\276{\211\303=\017CQ\275\267\326$>\343\350\231=#\0220<p\275t\276\206\313\002>o\353$=\357\023\265\275!\354o\275\033\034\006\275P\231\314=\277Rk=\016\t\231>\t@\221=/Lm>$e\333\273\036\354#\275eER<\361\252}\273\300\030,>6B*\275*\231*>\344\033\242=T\306B>h9\336\274\'\340\244=\273\327\302>\225k\033=\005\311\261=\n\203n\273#3\256\275gD\352\275\200\022\032<J\021\236<l\322\222>v\313\002\276\0340p>\277\325\262\275\246\te=\233\340\n\276\310UZ=\274:x=\312xy\276\370\0228>\305\306\312=\305\377\232\275\221\035Y>-b0>\206\016\311=\367\340>\2758\224\350=F\246\371\275\311\354\357\275|V\273<m\\\014=\177\026\006\2768\t\311=d\300\3319\200\202\225\275\347k\344\275r\200\235\275W\367\'=O\242\350<\232\037K\274\361\360\255\275\337\224\t\276P\305b=`\002T>I\312\257=\227\002s\274\2354\307=\240\350w\273\315!r\275\354\251\276\273\"t5=\346\321\023\276\024\326R=\334\034\213\276\202\003\347\275\356\335\000\276\250SI\275\240\204\223\275B\261\267\274\315\303-\276\214\302\030\276E\302\230=\224\334\331\275\301\010z=\307\231\244\273\"\310\345\274=\020(>\335\330\025\276\246\3139\275\223\273e\275AR\r;X\357]=\346\025\320=&\005\231\275\204.\265=/\316+\2753\316\007>\036\302\270>\021sS<\250r+\276\360jk>\237\264\374=\335\251\351=dZR=\262\364\343=)\303\027=\362\355\264\276\342\3555=\007:\307\275\340\350\372=^\222?=\025\'\220=\343\354\023>^\003\355\275\347\326\002>\250\331\276<\262\314\010\276i\203\006\276 \332\374=\203\233b= \177\214<c/p=+\316\264>\367\340\036>\017\220n=\372bS=\341\274\027=XF\374\275\263\312R\276\213Cn>36\356\274\004\007\207=\324\334\266\275\340B\024\276\r\206\233=JQ\321\274\260%\351\275x6\250=\321t\231=\177\304\021\276\03607>\016\340\303\274\332$\017=\223c\351=V\377\234\274\271\336\261\275\230:\333\275}\013\021\276\207W\210\275\032J\222\274\221\020\304=\240H\354=\336&\266=6\372 \276\240\250s>,\377\252=\226S\025\276\244\234\"\276H\341)\276Z\223\315\276?WT\274\240\207\275\274-\224\003\276\270\200:>\304\376\352\2742\035g=u/\022\275z\036\201\275\'\267\227\274\245\223\305\274\322\016\022>\2308\345\275Z\230\207=\242z\254<\t\023\013\276\021\274\016>\241\251=\276\236\277]\274\342J\251\276\366o\t\276\250\321E\276\253\250J\275\347\320\216\275\023\253\256\275\036\363\203>\205\303v>&U\027>\034gD;.\r<\275\276P\037\276c7\003>=\352\355<3\325\010>)$\312\275{\232\240=\271\354\226=\211.\200<\207qm\276\314^\353\275\340\211=\276\026T\374=\324y\'>\264\035\017<Q\3125=\244\351\245\275\331\016\246=`\316\025;\303~)\275\n}\016\276\345\331m>\013\327\t=\372o)\275)\377\224\276E\336m\275\020\016\277\275b\206>\275\236h\211\274U\315\371\275}\346X\276\223\315\305=\314\256\021=\303-\253\275\304N\300=\250\374@\276\017\203\200\275L\267\032>Z\331\237\275\341\307@\276\316\200\t\276r\n9>*\3329=\374ZW=[\002\016>\\\255\211\272w\321\214\275V\241D\274\177\272\273\275L\336\235>\367\203\304\272\230\224<=\371\272k=\r\203\231=\026\271?\276\233\325\001>\340[\006>/\227\220\274z\236k\274\0149\212\275g\234\n\275\266\276\202>$\273\r\276\314c\304\275\353\337E=Y\3573\276,\247:\275\2543P\274E\356\277\274\010\344\035>Q\347\373\272?\312\311\275\224\321\r\276\222\303\257=\246\3471=\354<w=\317\367[\276\300\332/\275\251\013\207\276F\2523\275\033DP=r?\364=\222\243\005\2760@\037>\212&W>\246\216_\276\304\265\204\275\214G\251=g\201\222\275\363)\335<S\332\313\275\377\203\232>\331\340:\275\234h\332=\347\311\001\276O\312\347\275\264\246\224\275\270\025\027\276\214[y\275\276\376O\276e\221{\275\224\017\201>\377\326\362\2751\240\350=t\272\210\276\2344\">\304K\227\275o\265\"\276y1\n>\035)I\275\223\301D\275\274 \031=\177\201\020>\276\nk\275\016r\234=\234\\\223\275\3354A>\212h\020\276\243\361\241=f*\306\275\212\010\020\275\310\231q\275\221\201?>{\014j>\217wH\276X\214f<\256*\307=C\320C\275p\257\250<:.s=afl>\262j\t>\037=\207\276/\265<=e_\200\273DKd>\213\275\300\275)\255q\275\211\321\247=Yj\202\275\261\027\326<\3401\212\275\033\227!\276\'+\220=\031h\211>8\021\216=\240\252\272\275\320\337\252=5I\001\275\251\233\r\276.]>> g\236\272\005\251Q=\207\333\335;\302\025\035=\017\272\200\276\020t\375\275&\202\230=\266\251\366\275\253\204\237\2757+\337\275\203\375\016\276\021m\200>}\002\t\275\206Y.>\204%\271\275\212\353\224\275$7\205\275\237\273}>\0336\330<{\261\264\273H\334\277\275\277\223\275\274{\361)>\255\021\005\2763\314\t>\020~\310\275\327\327\231<s\001O\276\022\223J=j\204\226>\2367\035==\253\226\275\333\203\007>\204\232\003<u\376.\275O\200\331=n6\213\275K\240 \276C\231\247=\235\300\227<<\004#\276\017$[\276\243\254\210>U\362j=\254>{\276\3231V\275\271\335\201=HX\201=*\316@\276\177\354-\276\340>\033\276\201\310J=8\376\257\275\033\264\242\275XIU\275s\255\227\275*\235|>\340x\231\275\027\246G\276$\354\024<\347c\262\275\027\320N\275<(\342=7\311;<28\022\275\357\364\247\275W\321\217=\r:\340\275G\262r\276R\252\311=\303\'\020\276\3122\037\276$\344u\275,\"!>\340\205\022\276\377]\343\275t\034H=u0\262\275\027\020f\2753\217c>Z\360\324=&\265\301=\200U\000\276)\356\003=\232\377B\276vF\261<x\2072>\331\237\341<&>\327\275q\r\026\276r\364+>B\200\">G\303\t=\003\364U\274&\264\345=8\234\t\276H\337\025\276$\0257\274\r\017\"\275\343\001\211=\206\210\302=L5\337\273wRq=\335\000\267=\350\346\234=\305\363\302=.\213\275=\277P\220=j\216]=\326\325(\275\344\364,\276\317\367\204\276\2375\230\275\367UZ\276O\232Q\276\216\337q>\340Y\017>-\350\272>\360\361\231\275\006-\">\217y\373=0\344m\276Vr.>\273\306 >\337\237\330<\"\333\252=\226\257t\276\004\255\325<\323\243\377\273\210)\252\275.\370\272=\360:\275=\367\022\210<\030\205.>\002i\311=(\201\211\275\354e\240\274\013\036\241;xG\000>>\273\213<\322xA<\003\252\245\275\352\331Y\276\023Di=\373z\362\275xr\324=G1}\275\327\204Q\275\313\324\231=P\"?\276\024\337\005=aYn>\2679\016=\214N\034>\217\014\177>\000\016\203\275J\212\024=\031ls\276\255\006B\275p\266\354\2757[\225=\374g\257<h\306.>\304NL>9\335\321\275W8\211=t1m\276Y3S\276\367 \272<>\266I=[e\267>D\201\327\275\346\340\316\275\365\002\201=A>\035>9\034\203=\252Q\302\274\315\033L\275\253\260K>\205\227{>`/7\276D\214\303=\255\371\273=\2410\215\275\346\367\017\276\250\030%\2762\325\254\275\367\244\030\274M\270\263\275\203c{;\334\251\003\275\000\nX\276\312\335\314<\224\303\272<K\031\304\275\233\343\002\276N\266\032>\243^\301\274\320\026T<\212\037u;\\\016\202=.\233 \276_\235\227\275\016\314\221=\004\271\307\273(\233c\2758\216\343=\006\310\035\275x\315\232\273\367\372(\276\337\350\317\274\202B(\275\035A\205\275\013\277\330=Y\252R\276\364\tM\275P\232<>1\212\344=\252u;\276\314\306\313=(\2364>\221\342.\276\022\006~\275T\367U=/1\267<K\263\221\275\207l\257<x7@\275\327\270\013\2755\306\007=:t\006>\217\301h>\320\371\302\274\006\227\030\274\205x\003\275\307\230\374\275\0162\367=\215\2602\276\301\355\033>\037\357\217=V\004B\275\025\017\261\275\337^\324>%\014\326=Z\270\002>\003\257$\273q%\030\2741h\023<\'\r3\275\363K\203\275\002x\327\275%\272@>\t[\263=\004\232\251\275\234\215\016=C\335\353=\016\251\301=\223\365\212\274~>,;\365\003\221>8_W\276\200:\351\275\351\356!\276\250\013\236\276.\346\307\275\212\336\377<\332s\312=)lo=ry\277\275T\227t\271RP\201=\256J\266\276\335\204N:\355\013\013\275\224\021\010=j\213\254=\005\312\226>PO\014=R\325\016\2761\002P\275\227r\n\276V\262\241<V\314\202\275\rf\'\275\271\016\013=\233ag>2\340\335\275m\226\342<M\270\204\275*c\302<\301\"\007\276&\207\030\276L\355\217\274\356\332\n\272<\207K\275\303\300\006=)\227\252=\031\224\007>q\361\020=\311\231l\275\264\371\223<\271\246\262>\001\201\345=\327R\365\275,-\306;\217\360c<,\346\302\275\365=m>,\272\024\276\277\223\312=S)\021\276\241\014\r\276\215a\r>\214\250\374=\235\276j\275\201Pu\276\306\364\213\275\244!\033>\031\345\277=\273\346\026>+\035\201\276\255\250\337\275eN\020=\334\204o=\370aZ>\254{\345\274](l>\367\240\366\274\306\320\364\275\347\264\221=?.\363=\246\231\010\276\261[1=\252\002\'\276h\327\231=\370\213\253\275hw\305\275\243\247\262\274\301\274\004\276(s\315=\305\3656>\t;\036<:$\216>m\213\274=\364\022D>E\207\211>\360\372\211>\253\247(\274\017\255x\275b\003z;/\210\210=7\377\013\276\342\030\303=\333\351\207\274~\242 >\353\213\274=,:,\275 A\305\276\\\347\350=q\321\240\275.\363\214=\223\031\277\275/\224\324=\024\006\023\276l%=<\031\264\270<!3\023>=A6=^\322\t>\204\036\350=m\202+=\325\326e=0#:>\271\221\240=\371\217-\2742Qq\275\264\361*<\373u\204\275\333\340!\276\343\264/\274T\214b>\334$\274=\030o\231\274\330T\220\273L\017X>\203\317\'\272\2562D\276A\250\215\275p\035\330<\000\177\026\276Q\031\034\275\035\326\323=\271P\242>\020\361\022\276\267Hq\276\36308=\313\312j=$B\217>\373\363n=\222z\366\274\336\226\322\275\235 \001>\310\220\240\275\251\213s=\205\336%\273\\\247-\274\314\200u>\006\013q\276u\017x>\001wY\276\227,v;\342\213*\276\223\305\206\275\330\307j=}[\326=\352\330\230\274B\246.=\304\177\236\274\240X<=W\326\300\274d\366\244=e\233\243=\367\310\256=\250\366\227\275\031\327\255=\206\356S\274\2414K>\000\232\'=w`\244=\306\233N\276\300;\200=\025\030\220\276\324\272\242\275\275\313\202>\021\345\371=\312dE=\254\250\302<\323l\253\274\036\237\343\275\327:\377=\371g[\275\361Js\275Q\343\016\2762\035\246=\020\'\304\274\360\r\337=\030\003\257\275reY\275\256\301\316\275\361\236I=\326\245\260\275,\005\256=J\233\206\275\306\2151>\261\300N<R\326\026<:\022\023=\302M\010>OqX\276\223\316N=\363\370\352\274T$\302\274\004\355\323\274-K\362=\320\322\211>\275\272\215<\037\301\246=\322\"\201=\334\260W\276T\300\022\275F\3722=n\355\274=q\303\372\275\234\014v=\265\177,\276\227\217m>\204q\212>\"\314\273\275u\020\225;%0L>\3641 =-@R>\267\033:\276\024\256\027\275yH4\276\335x\211=\352?)>\350\363t>\204\377\302=\277e\216>;Kf>\221#\013\275\254Io\276\3226\223\275I\276\017=\217B\306=D\252<<\367\204.=\251\262\225\275\244bo=\251\254\231\274#\014\330<M%+\275\222)v=~\217a\276\257\016\265\274\007l\214>\361}\356;\274u\010>\346\017U\276\200\320\327=k_\236>Qk\240<i\202]\276\177U\377=<\031\031\275\215\243<=\214q\020\276N\226\266\274\337\265\227\274\234\223\210\275\372E\343\275\21563\276J\025\211\275\251\227\005\275\311>\324\275\207\332\000>\"\344J\274\005:;>\277\274\212=\317\257\200\275\306\013w>\204\037l=\023\261\t\275\377\352\330\275w\326 >\222\224E>\002<a\272v\270\307=\217\357\344<\334bE\275Z\001o\275\246w\263\274\266;\340\275\024]\214=\343W\003\276=\ny=(V->\236Vo\276\262\217\210=\0241\273\274\031\335\014\276\317rQ\274\307\005\034<\230\251@\275\2166\320=\305L\206\276s\315<\275\032\261\033\276\3114\354=6\231\237<|\216\037>K&\224>\303]\230:}8\033>\354\271\t>\354\375O\276\243\370\257\273I\377\274=\023\033\264\275\333\253Z\274\201R\264\275\240\036\027>c\361\265\275%\314\245<N\326\260<\342\202\326=\312H\025\275\006\217.>q\367\010\276\351Z\035=k\240K\276\021\031\r\276[\327\003\276T9N>B\355\327=\034[p\275j\036q\276\316\t\221\276xu\331<#\'\'\276\201\327Y>\350\344\241<\3262\271\2769\217\300<\366\361\220\275E\000o<\340Mz\275\257\260W>A%I=6\214\351\275_E\254<\204\307\242\274\260\024\356=o\220=\275\226\214\334\275\364Ii\275B$\331=\026\273\337=\206{^\275|\360\004\274\032\361Q=\344\225\223=\261m\321=\322bY>$\357\333\275\313~\032\276\025^\263\274O\227\363=\276\265;\275\335\214\234>\013/\246=;[\322\275C\n\300<a\242b\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
