node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7730190
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\037A7=\230\3359\276v\344\224;\244U\277=\205\341C\275\177}\252\2718\235\017<\362\3141>MV\214>Hq\177>\362\007F<\205\241\273=\242\004\r=W\361\222\275\335=F\276t\225\313=\242yu>\036\334\354<\006\2579<\021\355\237\276\024B\307\275\377\000\366=3.d>\262\031\364=/f.\276\026\033\263=-\335\034\275t\342\224\275-z,\275R\022\034\276nv\305<\266.\002\274\323c}<\375\223)\275\351\352F=[\010\225\275\t\224/> \343\253\274\250\261`\276y\244\260\275\221CF>\033\330A< L\332\275\215\245\244;\223\005E\276\247\322\222>\325\361\207=\031\315.\275NG\330=%}\310\275\025\0271>\024NE\276\276C\376=\027\246j<z5\366\274R\255B=|\304\004>\317V7\274\256\026A<\311L\n>\t\355\337=I#\341\275\225=V>\275\2602>\347\0314=\257%\262<P>@\276\275\216\321\273\022)\031=\337;a>7\260D\275\361\035X\275\220\033d>\020\304)>?0\307\275\240_\223\275Z\177\353\275\315\367\376=\276\246\346=\027\213\266\275\020@\033\276\267\t?\275\276\243\024\275\301{L>b(%\275l\247\245<\304\3369=K\356\304\274[\244\001>\361\225\025<\317:\177=\007\304\026\275\375n\'\275\0059\202>\227\025\"\276\355\212\224\275\214\212%\275\313\2372\275oI\032>z\223\276=}\037Y\276\213\270q>\303^r\275\2723\r\276\023E2\276\220\007\373\275o\360#>eX<\276\3038a>\250w$>7\0016=2\211\201=\376\332\237\275<\337B\276\345\213\010>%\244\023\276\031;\324\275\332\n\n=\357\353\333<\344(S\276;K\264=\343c\241=\345\241\202=um\364=K\335\355<\233+q>~\242\035\276*\223M>\367/\030\276\231\344r=\316f4>\205\323\036>\032\227\021\276\034\242O\276D\373\034=l\320e>Eg\323\272\020\353\376;iq\235<\301\310\007\276\r\020==\263\370\340\274CS\220\276R0\207>\211`;>\351\345\031\276i\301\360\275n\272)>\237i\214>%7\035\276j< \276`}\t>\0027\212\275\375\006\361<\203\312\301\275i}\266=\r1C\273;?\232=2w\361<\353\244\227\275\000\214\342\273\300\031#<\202\271\320\275\3540\022>Je\035\275\277\250\027\276\032\273\210\274;\367\206<\245}\212=\271\341\213\276\245\222\324\275i\010w=\271S3>^l\235=bki\275\323I\322\275\210\203g\273\210\337!=\304\334\312<X\251\306=\330\022M=\2332\r\276\345V\214=\250\353\315\275\302\361\236\275P+1\276\334\257d=,\307\246<\342\017S\276\274\034\210\276\034\334\022\275\220\322\212\275\307m\277=\222:\263=\244\361\001\276l(f\276\232]\210\274\216\276\321\275\317\021\261\275n/\000\275#i\334<\274\023\020>\260j\271=\254\254\367=\2172\376\275\311\244\330<\254yz\2765\3724>$>\">\366\367]\276\235C\351=^P\361=\234=\210\276j\005\006>\371\331\343\275\231\024\216\275\273\n\205=|, =\034$\335=})\307\275u\337\022;k\242\367\275\'\205[\274\330\347\207\274\014)3>\346\370r=cN\346=pB\n>%\243\303=aX{\2742\212.\274\273\330-\276\036\344\301=\r\370\367\275\203\235\274\276\263\312\245=\337\2202\276H\352\035=Z\240\337\274S\022\212\275\210\276)=\020S\204=\314\022\004\276\316\006\307\275\364\0379>Y\225{\275\261\033=\276t\250\226=p\277\n\275*\341\330\275H\362\214\276\357^$\275\3118\326\275\271\337\036\275r0N\275\276$g=\377=\226\275+\010\246\275\322\263\254>\263O\317=\323\203J\276\024~\277=\250\222\260=\345\357\r=!\271\344\275\243\364\216\275\331\366M>\301\000\221=\363\307\342<;\347\220=p\254w>\363w\234\275\\#Z\2761\006\250\275\357\274%>}\331;\275^:U=\2766\275\275\377\337\354\274\323\264\223\276\262\367\005\276E\226\026>\276\315\r\276@9\371\275\207\241;\275)\2542\276\243\204\217<\363/q>)l\311<;\343|\275A\322\221<\267\316u=\221m\000>\003\313\311<\270\350:=^d\240\275f8c<\037\301\002\276\373\034+<\037\327\211>\271\027\234\275\035\017<=\212\342X=\232\014\030\276\355\207\270\274\367(\337\275ClL\274\215\304\314\272\275\365\356\275\343&5>L\344(>@\000\373=\033\363)\274\245#\026>\244\021\224=\243D\213\275\035\231\237=\242\367\315\275Y\n\005=\027Z\234=\317/2\275\033\210\363<\351\223\033\276\0356x>\351\233u\276g$U\275\300\210\277=BN\366\275\320>\013\276z\243\302\2757\306\005>\372\301\346\275\375\212 \276\036\232\240\276bm >5U\345\275e\225\335\275\r\317\273=\010\304\222\273\247\266[>\260H.\276\251\336\001\276\276aO\275\030\036\210>\010\246i\276}$\303<\2775r\274t\370\240\274\263+:\276\3143\032=v\313\345\275`\'\336\275\241\024\367=\335\266\027\275\256\204\206\275\037\002}\276\201m\223\275\371n\371=\252\237\027\276\r\251\265\275/,\315\273@fW>\274R\221\276\006\254\222\274\274\020\367=\207k.>\261*\202\272AO\313\272P\333\263\275A<\201>Ht\324\275\216\225\226=\355m\317=\252\024\205=\353\214\247<O`\021\276\233P\304=\352S$=\265\202\202\276\200#\274=^\336\212<\020#\250>\"\231(>\301|\240\275\257\337_\275\253n\271<\360\210\033\276\277\034\013\275\304[\202=nI\256\275\375U\023=\313\350\220\274\241\315\264\275\036\304\346\275Y1f\274\024\351i\274\331t\203\276E\344\211=\030\217\006>\006T\216:\340\354\020\275\223\320k<\274@3>j\037\003\273\274_\360\275\n\330\347\275m\r-=\364\256T\276\246%2>f,\250\274\310\326\267=\221\032i>\033u\366\274\tY\370=\317Y8\276#\342\371;\361W\037=Tx\316\274\310{u>=\3446>y\022\021;\242V\303=\017\rw>\275\245\">t\330\025=Y\'\246\275\246\024F=\365^E\276_\256j\275\354N\275\275\247\205!\276\352\333/\276b\361B>\314\345+\276\373\325Q>Mi\024\276Y57=S\344\366=\010\325\225=\303j\232<\272K\264\275K\256\035\274\260\021\201\275Uqi>G\246\034>c\374\010\275\253,\311=\315\324\327\275\214Jw\276\235\244\313\275>|\224\274\332\265\006\274\216X\340=\315P\205=\242\3302\2768\201\201\275\257Q\263\275\306{\256=Z\n\223\275$N[=!9\371\275\305\3101\276\032\210\032\273\366\026\343<\276\265!\276qH\266=\214\005\213\275M\257\304\274E\351\341= \200j\275\221\233\031\276\214\031\345\275\356\305\\=>\261\245=C\206\004\276z\352\027>\237\363\217<*\203\244\276\200\024\\=:\025\245>\224\305<<Z\226\313=CJ]\276\036\252\253\275\305Tq\276 \225\267\275^\313`>\'\002\036\275\243\375#<\001\032\026\276\201\342\251=\232\257\027>\232\331\215=\301\260\221\275`\t\257\276Wq\315<%Q\024\276L3\202=`\364O>Z/\327=\277lH\275\000\220\341\274\356\330\025\275>(p>\274\010+\275A\341\207\276A\006\210\275Vl\211\275\017\364\014\275\036f\215;i\277\014\276\363\334^\276#d\010=A\241\333==\254\361:,c\350=\243\320.\274\312\017\237\274\324\213\303=Y)\276=A\261\375<0\375\242=\363\334\212=\2414\t=\034\315)\276\t\021\304<C\335`\275\020e\261=\033f#>^ao>I\032\205\274\237KI=*T\024>\335\336\023>\255\353\025=?\201}>S\227K=\376\326i>\373\245\016>\t\345j=Y\2549\275\210\367\307\275Q\240\366=;\336 \276M\225\\>\366?\004\274}\205\270\275<\303\310\274-\023d\276\261iT=Md\326<\321\2730>\272\262\221>\032\270X=\230 \r\274\264\204\t\276\32554\276s\335V\276%\307a>\341\241\310\2746$\346=\350\244|\276\242\234\013>\323\346\364\275z\333\207\275\373\357\023>\371\317\252=\202\037\340<.\312\343\274\247/+\276;\177y\275\2244\273;@\265\034>Kb\005=\257\300\340\272\357\250\005\275\371\306\223\275-\277\373\275\027\263]\275\214\200L\276\3662\023>\324O\277\275\357\313x<\002FH>\031\326\263=\220C\230\275\2066\357\275\234\362J\276\013\205\255=\234\273 \275\374<\361\273\221\365\225\275\343\025c>\231Z\033>o\266\357=\376-\333\274\'\037\325=\274\354\243=6+\207>\006\251^\275E\262k=\216~\233<\005\225m=:\354\r>\013\217*=\357]\033\275Y\013C\275c\020\330\2756Y\020>\243\272\375=\2269\010=\261\317~\276\001\260\233<7\037\014=\027\216\343=2\021t\275p\272&=\227\257\233\273Wg\357\275\250R\024\276\2665\013\276\220o\360\275\027\346\022\276\275\310 =\371\360\177\274\354\317;\276J\272\224=\354{\353=\177\366\327\275\255F\322\276\036w\207\273!m\256\275\342\264\231\275\020{m\276\221Nx=\264\2413>H\346\325<\272\354D\2754\3526<\266`H\276\365\335T>.\254\003\273\306t\326=n\"\023=\036\311\">\234pn\276\342B\354\275\264v\327= T\214=\034\277\236>L\3408>\300qX;L\247\005\276g\256{=B\r\316<f\3261=!\223\030\276/\313.>p\316\372\274R\313\263=\304/\256>w7R>Q\220$>\024\203\201\275\300ze\275\\\233\321\275\277\001\177\276\272%\252=P\322\313=q@\243\276T\326@\276p\232O\274r\205\311\275\2610D>m\266\236=,gc>N}\205\275gjr\275\"\0014=O\213\020\276\2306\020>\343\257;>\235|\376\274\347I\016=rG(=*\356\270\275\225\211\024\275\343\3030=\345=\222<G\216e\275\032\025\372\274\007Pv\276h\333k>\337S!\276\353\275\374=t\270\236\274J\2335\275aT\272=\210m\242=\304\267\337\274\351\376g=\265h\314\275\235\266\342=\3464%=\336\373c\273\2551A>1\250\265=^\317W\276\324\227\002=LK\330=w1\261=&\020l=<\350\230=\226\217\263\275\233\3134\275\210\010\177\275\222l>=\221\263\333\275{k\006>\314\336\026\276Z\303\354\275\313\311\032>4\266\345=pi\277>\262\3640>\352])=G2\201>E#\211=4Sf<)\275 \275xP\017\275\212\304<>*\211\035\275\3144\300= \365\230\275\230\207\360\273\343\345\333\275\320\326\340=S\376\202\275-#s=\274\3045\276\262\3527>>\370_>V\'\374<\177\310\261:dYe:\263Nz=\253l\336<6(\"\275\222\332\353\275\336BY\2763\276\354\275i\377\007=f\010A\276b\345\010=B\355O=\254\335\031=\"M\233\273\326\351)\275\353eD\276|\002t\276\305\271\222\2754#\240=\032\213\212\275\252\340\'>\030\363\247=j\366\014>\202\025\317=\354\210\274\273\261^\016\276\026\221\177\276j\n\317\275\225\213\007=p\210\034=\0002B>\247\320\n\274\014U&\276PY\247=\327\327\233=\245\200j\276\331l\r\276\202j\035\275o\016\223<\256\013\271\274r\313\204=\317\343F\276\024\262*>%\006\002<\306\354\207=jsA;\371Zo\274Z\375\033\276i\016\203;x\363\270=\377\346\330<\244p]>\324\364}\276\222\301\371\275\357\262m\276\375$\020\275\\eI>O\3746\276OI\002>h\314$>\236\301,>\215B\322=\232(5\274p\2272>\205M\277\275\236\347\235<\"u\225<8N\225\274W2Y\275\272.}\275\255\360?=\343\206\033\2767\312\220=@\240\003<m\217\021\276\307M\031\276\\\321\220\275\267\254\362<h\337T\275\274\300\334=U\332\277\276^]5\273g6\213\275\014\020\023>\212U\023>\270\203\332\275\214^B\275<\377\216>\246\265S\276wp\000\2763\017\000\276]k\334\272@\3446=\270\232\004>2\020/>*\3235\275p\375\032>X\312\206\275\351d\372\274\244V3>|9v\276\354\276d\274\354\020\\\276\331\314\333\275%\371\214=\037\342y=U\300\270\274hA7\276\251\006a<\375D\207:{\377\216<@\334\232=\005\215\216\276kc\367<:.H=\321\216}>\317x\225\275\267R\254<\217\322\004>\246T\254\275\241\013\030\276\340Oy=^\351 \2765\250A\274\275*\375\274\257\376\001\276\213\341\013\276\370\363\245\275\327\215J\274m\016\034=\367\332\246\275\201\3246\276\242\217\227>cH\026>\3349\244\274\264?D<&Y\r\274\3406\254<\366k\347=y\211\014\275?\301f\275\232o&\276t\023-\275p\277\240\275\273\312]\276\332\374\004\276\305\201\274\275\352\277h\275\333B\016\275\261\217\273>\234\0220\276\206\311\037\276A\343/>\360\375\327=\212>\236\275\223-\221\274\232c\237\273\022.\370:\320\034\233=\260\222\231;\177\234\323=\225[A>\326\302\002\276\221\010S>,\355\000>\014\325\207\273Xn\304\275\242\337\025\276\310{P>\305\373\262=\364\377\204\275\263\n\021\274\240\007B=\003e+\276d\0038=\204]\306=\333\362\310>hg\007=\343:\377<r\352\207\274<\001\222\275\202\345\203\276\317\005\337=\032Z+\276\317\031\353<\340A\267=Y\235g<6\356B\275\340H\211\276L~H<\237\004&\2760?8>\025\217e=S\344E=\234=\211=\225z\217<\000x\326=e\007X\275\244e\257=j\313\302\274\232\250 \276*\\<>\200@.\276,\031\306=6\343><\242\331\037\276\177lr\275\022j\341\275\022\0131\276\305\304V>\035\330\001>\254\336+=\177\246\211\276\371bj\274\"\035\346:9\364\216\275+\036\340=oc\202\276\327\262\256<\223\020\303>\315\374)\275\010\005\373;b\262\014\275\303\312\r>\t\007\264\276\222\357\201\275\352b\364=C\337\246\275u[\363\275#\330\327<\\u\034;\230\3511\276\225\264\260\274.+\321\275P\323\006>`\273\366=\357\351\250=-1\013=\332\233;==9\030\276\023$\017>\332\2177\272\274 s\275)B\311\275\352\361\010\276W\300\375\275l* =\240\010\355\275\340\306\255\274\267\036\351\272\233\301?>:l\'=\330G\203\2759\243\336=\263\032\231\275\007\235\014>\203\370\274;\001Y[\273\260l,=\215\035\301=7\r\034\276U\372K\274\304F0>-\201\362=\325z\210<\332\014\t\276gO\257>5\216G>\005o~=M\376\222\275\371\270\037>\250\260F>\306{@:\213N\220\274=\317\237\275\017\211\377\272\333FR\276\337\236 \276\317\342y\275>\254\356;\n\302\035>g\301\007>\007\314X\275\325^\222\275\001z$>\036\001>\276W#\025\276\224b\206=\305\256[\276\216Kg\274\322*T>O\2244\276\306b\006\275\027\273\243\275O\343\312\275\275g_\274;\031?\276\027xD\275\244:\224==-\346=\261\032k>\354\346s\274k\201\267\275\n.o=\'k\306=\001\333\217<Ea\246>|l\027\275\303n\352\274^<\306\275\263\235!\276c\013n=\225\030\026>\2704\216=\017\363B>nN\361=Q,\223\273(3%>\331\257\265=\223Sw>\201\016\265\275\340\243\302=q\213\002<\236\323\251\274\366f\262=\363\026L=<pX=\357=/\276\344\265\311=\265\302Q>\241\255\352=\222z\\=\331_h>\320Db=\255\215\205<\177\3665\276\322\227\022=Cl\026>j\257\235<h\246\221>\271e\257\274v\360\364<\264=\373\275\302H\037>D\356\257<\325\215\251\275I\352\001>z\237W=\001\002\261\275lNl<\311\363)=\342#\330\275EsF=\330\224\364=\222\206\347\274N\225\311\274\366\037\235>}\373\330=tH\241=f\201s\275\360\004/\276\n\340\261\274\360\333\000\275\343dc<\267w?\2764J\250=\222\346\317=\367\323A>\303\234\023<\236`\321=\214U\025=\335Y\033\276\022^\242=\376\357\225=\320\264\003\275f\024\353\275\206\000\201\276\033\211\210>\233\353\261\275\342\177p>=\316\361=9\334\217\274H\256\304\276\317\211\004\274\247!d=\'P\222>@x~\275^\341\250\275!\260\211=\356\213\321\275}Pb\274\315\253\242=\035\007\252=\347X\230=\303\214n=\254\265\201=\256\336==V\006C=\372\303\310\275ns\005>4r\206=|pK\275\267\177\">\371\340)>\345\205\274;\036\236_\275\227%b\276\312\2561\275\217\231\200\275t\352\\= z?\276\324\264\020\275\013*\253\275O\264\325\275\255\215\013\275?\221\n\274\357\246\246=|\251\267=\301+\022=\000\303\375=Ux:>\321\320\020\276Nq\204>\260\371B\276\235\350\210<\026\212>\275\377yD\275\274\363\200>\262\350\360=\374\2754\275\330\233\306<C\024\301\276b=\346\275\023{\331\275\317\262!=\006jX>Nd\241>{\324&=\210\027\227=^l\360<\223S\207=C|\230\276\nL};\267\020\256\273\336e\261=\370RH\275\364q\023\275\361\020P\276\003&\345\274\346\371^\275Z_0\275U\350\342\275\021;\317=c\024\211=\376Z\034\276\222s\225\274"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
