node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 55147
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\362\234\n>c\027\027\275\260\310%>\242\334b>\265;>>,\020a=\004\236\255\275gY\276<\302\n\323\275\233\277\206\275Dx\236\275\237\037\202\276\322\035\002\276\3745\305=\224\252.\275C\253x\276\231\305\235=\276\242T\276D\300C=\002\221y=:\234\023\276A>\371\275\010\033\211\275\270\001\223;+_\205\275\270\016\':\240\310n\275II7=\314a\021>a\025F<K\342\365<\307\306\010=F#\322;\317g\306<\373\346\002>\251\016k>\261p\323\274\351\222-\276.\261T=\255\260\235\274j}\360\274\361\345\333=\016\307\022><D\352\275\232\300\031>\255\277:>\270\247=\276\346\236\216\276\374:J\276\377\313\316\275\227S\245\276b\300h9X)\371=\367\004[<\276\253\210<\314\256\025>H\254\r>\245G\000\275D1\t\276\334-\005\2769\'`\276\3135\037\274L\001U\276B\023\216<+\257\033=\334\220\241:\213\0077>\034\216\017\275,\360\372\275x\307=>\nSZ\271\323UA>\337\017\303=\265\370\222=\270@+\2750l\242\275V\2449\276\006\334\036\276\222\265d>1O\016\275M\352(\276\244\223\271\274\013\343\354\275D\177=>\234%S\274\314\030\372\275\214\377k>\223\352\206>\272!&\276\2242\264<\300\251\356\275\260\206\277=\231\322\211\275\276z\333=epF>\334\363B<\305 \275\273|\341\214\275\354A-=6\035\t>;\237\344=\375?\025\276\265\3664>\245\260d\276R7\266=l\337H=\236\007R\275\013BV>\030\377,>\344`\261\274\207) \276\307\216\225<{\002\262;\207~T\276\302d$\276\344\n\026==\211\217=\306\321\301=\271 \277=\350\t\005\274\203i.\275\003\320\326=\223xR=j\243\024=v\tW\276\037>\210\275\334\253\n>R\375\252\276\364y\223\274\323/\316=\320\034\214=\350\350R\276P{\237<\276I\023>\333\354-\276\022\014\017\275\250\246R\275\375FI=\022\356\357\275\021\030+>\332\233\272;P\207\376\273\242\325N\275\'e\023\276\311\317\322<\217\205\016\276x\'\223\274\361\201\340\273t\256\034=\262\344\200\275\014V\374=j\363)\276\230l8>\300\241F=\"\244|>j\243\322\275\340\033\363\275X\027O>\374\301\323=\025\257\253\275\n\007\034\276\375\232\024\275l\271m>\276\201\225=-k-\275\320C\034\275\'m\267\276\227\220w\274\341\304\241>\314\037\222\275o\215\201=H\320\027\275f\023g\275\271x\214=\034\022\037>\002\026\220\2757\366\013=p\312\276=\350\204\234\275\354\273\322;h\215P\276\rr\244=X\3412>\225~\336\274\232\033\244=\3410\375\275\357{\250=^\226#<\025\322\334\274\204\246)\276\234\307\316\275Ts\013>A]v\276\321\030-=q\325u=\312{\301\275\014\312E\275Q9\272<\013$\027>e\0209=\275-\r=\rs4\276\317pA\275\010\234\216=\\\201\010<U\004\202<`\022@<\2472I\276\t)\325;\352i2>\255^\023>\215HB\275\310\276\032\275i\303\"\275\362nN=_\202\336\275\010\260\273=\301\231\347;\034iA<z-\374=!\377G\276\365k\227;\332u9>\276\342\302\275\035,e\2769\252\345\276r\353\023< .7\276j\341\204\275@\355\345=\205\260\016=g\255\006\276\314dR=\302\236]\276\207]W\276\273i\002=h\305\017\276\265Q\201=\230\253Y\276\222?\022=\241\232\371=r\253L\275\317\275\005>b\027\255=\031`\037>(\r\013\275\236}\305>P\251\254<:\357C>L5\036>4\216\373\274A\241;\276=\331c>Vk\334\275\266\243\255<\347\335K>\366uA\276\024\245\255=\342B\253\275\362q\345\275\304\343\232\275;W\204\273\037o\250\275\322\000Q=\335\263\276\275\25198=5\216l=T\315[\275\233T%>\014]\364=a\325M>uk\245\276\377\311\312;\322\232\357\273\253\252\013\272P\030\220=\0165G=\367R\232\275\246\315^\276\340\262\203\275\324\352\356=\267\356U>\353@E<\211\256\020>gS\331\275\316\010\260<\0222g;\215\362O>\346M\026\275\274\223%=\332P\367\275O\237\333\275\356\3653;\\\352Q\276I\234\031\276+(^<7\021\362=U\236d\274\325P\016\275\323\314\202\275\232\220U\274\235\000 \275\311\313\210\275\277\322\225\276\304\250\210>0\347\215\274\023\272\212\275\226\t\250\275\213m;>b\276\357<`\226\233\274\353\037\030\275_\236\000>vP\303\275]v\331\275\330\"Z\275f\272\224= \342G>Rx\037\275\003\333\017>|Z\202\276K\332\016>2\317n=M\325\035\276\'h^\276\376p\360\274\376|B\275\250\340(\276=,\233=\261!\270\274\270\324\214\275[\353`=J\356 \276\356o+\276|b\210:\211\220\335=N9\330;\034%\014>\205\032I\2769\330\312>\313\302\315\275\226\356U<\177\001g=w=\027\276\334\332]>\\;\225=\271#u\275;?\210\275\267NK>\204?\300<.\203\345=G3\214\274\205\2675>\303\352\213;\004b\313\275e\277@=}Nd<\026\327+<\261~\234\275\002\242\235=A\223[=>\0012><\300\234\275R\\0\275\300Vs=P\210==w\004)\275\324\266\177>C4\247=\361\376\002\276\303\326\375<\212\177\251\275Z\207\360\275\225\207\024\276\254#\312\272\212l\263\273LM\210\276\243\343\377\275\301\303\274\275\000\276\242\275\260[\n=\277\005f>\310\333S\276\231C0>\300X\037\274t\343\243\276\235\323\024\275m\345\017>\'\252#>\226\376\253\275\351\242\260\275*\024\342\275\344\311\021>\341W\200;]\014\030>\326\353\026>r\3202\275\316NZ=\"\220\226=\215\367\264=\251\216[=\036\233\030=*\270\024\275/\211\\\275\271jd\276\223A\025\276Y\371\352\274\325{^\275\252o\211=\202\254\213\274\000\322\017>R\361\234=2}\">\t\226\270>w\205n\276\340;$<\006\005\314\274\222\377\370\275D\241\"=\031\320\252\274C\351\303\274b^\017\276\2307\263\274\321q\001\276\344Z\207= \375+\275\374^\356\2756\204\206>l\027\301\275\237\276\223<]p\277\273W\230\"\276d\002\024\274\'nw\275\223[\007\274\245\225\010=\206[\263=p\317\n>.\365\032> \376\223\275\216\236\021\276\367\272\025\275\200\331\211<\2106k\275+ :>\344\035\200>\230\221\373\271.-\320=\300;\343=\035\273\222\276N\350[>P.R\276T\313M>\207t\307\2729r\246=0|(\275\236V$\276\207\355\031=\377\233\312=U\177\247\273W\025\224>\255\242\372\275\263\023\000>\303\260\r\275\244\014o>\225\376E\276\035<\210=+\\\350\274\004\221\375<:\331\350\274\273\024(=\275\2125\275\r0!>\003\230\223\275\347ri\274o\256B\276(CB\276\272\340,>E\177y=\340\277.\276\221W\222\275`\"g>\356]i=Y\000c=\236\315\241=\201\353Y\275J\007\324=\031\225\032>6E\212\274\242\0166\276\206\351R\275\266\010Q\275\236v\200=\233\373\232\275<\364W=\275)\177=K\200z>\230\365\200=\374\360\277\275>\205\017\276\210\276\207=\335$\007\274\344\033R=\'\322\010>Q\301\332\274\204\232\272=\264\267\033=\372<\355\275\253\0051\276\205G\257\275\002\274a=\372\r&\275_\026K\276t\023\201>!\300\347\274+\217V\276\'6\007>\356\234L>\267\251\026>\266%\034\276M\225;=\335\200I<+\\\013<P\261&\2748+@>\321\236\000>^\340\016\2766\304\003<\316\'\221>\022h[=\025!\200\276\26510>\236\"\301=^u\361=\031\354{\276\307\303\013<\366d\243\275\363aN\276<\021%\276\352-\201=\207m\305=zJ\244=uL\371<C\003\262=\0046\215\274\021\343e>\"\376\031>0\025]\274G\2612\276\367\251\020=\250A\026=\227\274h>\031\332\312=\250O\305\274f\242\346=2=\020\276\205\251\006\275Lg\366\274\341A\026\275\302\241)\275zz\002<\312\312P>\260\036\014>\342v\200\274\214\361\t>U\252O>\177W<\275\336\324\020>\355?\037=I\314\316\272\371\250\034<ja\253\275\343l\365=+\030\033>`c\030\276\277\242\237<\026\2745\276\354\223\307=\316\322A\276\333g >o\355^\275F8\240\275\245\257\231=\002\272\r\275~\367\316<NY\227\2736\261\330\274\022-1>Ow\361\275V\023H\276\255\320\227<0@\036\276\216p\025=\333GA>\327\024\350;\265\250Z>M\373\033\276\351B\205=\020\007\354\276\2146\336=\224\250\005\276\r\322W>g\347i>\020\021\212\2747\r\353\275\003\022\322\275\177\276a\274dIO\275d\373\225=P.\325=\304\371\243\276\351\246\023=\355W\177=\303\330\360\275Hk&=<\247\324=\312\200R=\365\231\340\275\257\033\376=\314\250\214\274p\223\227= \237\263=\233\020\333\275_\352\t\276K\022\244=Zh\025\276\r\262\257\275\243$Q\276[\017\360=\223\300\225\275\253t\034\276\037\334\375\275\355\034\226=G\031\211>\'\2167\275\323\256P>\241+^\275\361\372\344<\305\243\310\275\357\264\231\275`}7\276*\255f\276\247\327\363\275\354e\337\275E\245}>o^\340\275\237xA>\357\003\t=\026F==\255n\221\274\0069Z\275\333/N<_\033^\275a\2309\275\215o\374<F\025^>\3153\206=\026\003m=>b\356=.\367\200\276\\KA>\035z\354:CU\010\276V\357\327=}+\323=C\350\216\274\036\025\346=\211\207\006\274\252\013u\276\264;3\275~`\'\275R\222\"\276\274\311\274\274\225\020\003>O\026\230\275\361\241\216\275\242\336T>\202\204\003\276M|\017\276\227v\214\275\021\3679>\3604x=\220\242K>\2076\342\275,\2730=\221\344\322\275=\2616>\030\231\023\276\325tW=:\331\211>\3679+\276L$J\276\241v(\2755QT\276W\345\013>\0148\373=\254\210\317=l\357\227=\245\021\177>tj(=\032\273\317=\024\032{\276\354\364\243\274&F\266=X(\034<*\227\335<\245\035]>\250\n\014>\031\241`=x\307\366=C\341\366=\357\334m\275PG:>\272\344\226\275\365\nX\275\300\'\360=\371S\312\274\240\221\037>e\230\326\274\200gs\272\237W@>\000e\022\276\347\n\271\274\202\001P=\353\304v>o\2762>#a\276<w\002\005\276*\205\277\273\317\232\204>N\272y<]\365e=\031\005\213\274=)\364\275\016v\354=\355\373\275=]$\215>\n\312j=\335u\235>\254\r\021=\313b\243=\316@\235\274\333\207\326<\321;E>\341\367\351\274\226\360\227\276%PF;\355\030\037\276&N\031\275\360\0257\276\362\205\200>7\316k=D\360/>\312\211\224\275\314\376\331=bY\034=\375\352\303;\267b >\336\027\240=\003\226\213\275\310>+\275\314\334#\275O\236/=V\037\017\274\241\214\305\275\220\031\211\274\324\030\r>\204m\034\275T\350\325<\272\216[\276%X]\275}\250>\275lb\252\275\347\232\214;\266\204\216\272\351C\025>!\345\271\275]\214.\276H\177\263=\031lk>\245\214g\276\252\314C\276\377\247\315<vq\007>\376X\371\275\024\311\'\276\306]\231<\341\341\000\276\3324\023>{\3718>6;\323\275Nn7\275\244\'\205\275\350\255h<\025\023\">\236d\356=\374\273m=\016\310\330\275$S\022<\327H\301\275\204\013\206\276N\332\t>\305\344r=\274\246\013\276\206\202m=\2633\240=\263Lp=\033\263q\275\310^\220=\227\314/\275\316g\256\275\324\244\242<\317\036+\275)2\271=\027\035\317=\031;P\276\016\242\007\276\330\004\021\276:4\320=\357\023\372\274\233v\003=\344\032\022>A\377p>\254$?=\341#\007\276\031\274\337=\3614\023>S\t\344\274B\234\301\275\376IG>\222h\333=\237\227\207=\266]\223>\312\344O>\373\006\003<R\370\216>9=\334\275\257\033\272\275G\307\207=Y\256?>\2077\211=A\000\311\275\260\250\204\275\201\204:\2753\204\031\276.[\345\273\226H[\273N\234\023>\303\227\230\273`\234\344=R\347\335\275\206\036\000\276;\210,\276\201\304\210\275dAE>\316\220\026\276A6\n\276\000\375\023>\0143%\276\310\223m>\211\272\000\275F\374\362\274\250\035\200\275\374`\032\275\022\225;>\031OX\275\035\223|\275H\013Y>\317]\212;\227\363+<q\270\221\274\304\271\250\275\215\n\243\275l+\n\276I6\210\276\305\375\021>#?~>\310L\267=k\224\360\275\\r}\276\226n\256=\360/%\275#\3656>y\325\013\276\214\360:\274}\333\261<\004\203\244=\030V\360\275\232/\205>\275I\260=+\204\334\275\355\343Y=\235\364\333\275\200\307\257\2758\000V<x\361\213>\343\364\351\275\317\242\237=O\274l<\352\244T>\242V\343\275gO\215<\356K0\275\360\353O\275\261\263`<\211\314k\276d>\004>\033\222\206>J&L\274\256S\035>\210\324\223\276\201\265\357=O )\273\"\243\317=\375\313\260\275\374$\257\275\020\366q=\346i]\275c\'\035\275\345\225\270\275\010\243\036\275\0331\014\276i\303|>X S\275\033\017\317\274\274F\320\275\357\231\204\276\374\313\\\274\334\235\310\275\037\001\374\275~\002|:\330\275\343;\177\224b<V5\332\275\356\253\351=\023\343@><m\247\274bje<\377\210\005=)\310\016\276\214\363!=D,\212>\326)7\276\243,\300\275\316YR\275\267a\376\275\007T\356\275x\022H>\337\215\"\275vbD\276\216+\306=s\260X>*h\326=\003\035,\2755\201\020>\355\350>\275t\227\366==C\317=!\007\037\276\346\231k>\331\305>\275%\372+\276\317R\300<\033\336\375\275\246`\306=\262\257`=|\217\301=\':?>\256M\r>\035\303\226\275\024\215\272=\226\356`\276s\230*=\323\237\024=\037\316\227=:\344{\274\034\022\203\275l\345t\276\252<U\275u\343\343=L\236\306;\272H\334\275s\367\037\276\016\363b\275f\354\215\276yoG>\327\360\233=HJf\272\351\275\303\276\25253=\301\271\356<q\014\204\275\211\311\304;\017\2771>u\013\260=\017:\253=\233@Z\276\014mS>\030\032\341\271\243\322q=:\331\014\276\334\236\263\275\276%\266\275\022^\205=\215\230?\276w\204\356<D\213h>\004U\227\275\377\210K=\332\362\355\275\332j\r\274\300\232X>\377\247\377\274\022\222\374\274\300\3743>\200\037\003>\313\233\021\276\3777\017>\307\227\335\274\300\n\232\274\n\022\276\275:\332\352\274D!\354;[\251\003\275\227\344\200>\006`\360\275\244\326\204\276g\254\022\276n\305\017>w\346`\2769m\027\276\320\016\320<\306\207>=\264[\2668tQo\275\354\375\007<\362 (\274\200Z\376\275H5\234=61\024>\3616T>a\350H<wM\016>\364\222K=Y\037\231=$\006\265\275|%\222\275\241Y#=k\373\301\275?\322\250</\335\277\274\307\0276\276\301W5\276Bd\226>\t\032\244\275\314\214\335=&\303\'\276\362\360\332=v\351\200\275c\010\267\275\213\227\274>\267\213F=\233\231A>\371A\223<\325\240\017\276\201>#>\022\213\252\275\003\206q\274AK\033\275\t\034\023\275.w\035>W\333\217\276\021M\243\275\322\r7\275\213\t\347\274C\304\335\274\342\032\200=\351\345\276=$\371S=(\230\004>\233\010\266>\"8T\275\r\263\274=,>\264\275\255\032\215\276\316,\346\274\036\323\253\275\204\247\376\275h\261\246=\204QS\275\325P\005=\273Y\204\275\"X\277<Q\017\336=\235\315\232\276\254\342)>\227x\030\276V]\307\273\250\214%>P\306\326=\332\035`\275\354L\237\275\222/\r>\005\304\016>q\312\261=L\225\231=GZ\340\275\340C\"=\004_w\276\364\333\212\275\211z\340\272\313\353\247\2745\r\354=8\346\233=\007g\351<\247S==\271\324&<@Z\317\275_}[\275;\016\270\275k|\211\275w\367\023\276\340\3038\276\035\332\210\275\317\213\031\273\"\237\211=\334b\025\275$p\354\274\237\326\242\274(\321\177=je\344=\022\3338=\'\373\235>o@4\276\201K\246\276T\342\035>\207(Q\275\003\034\255\2751b\242\275?3\315=\035^\205\272\363\n(\275\356B0\274C\304\206\275\00108\276?\350\353\274\307(\230\274\2366\t\275*\022G\276)\301]\275\212K\357\275l\001\365\275t\252\022>\373\370%\276$IL=\251\332\007\276w[\311<\255\320\341\275\002\245\031>\273s\311>\337F\002\275\251\336\217>\0203\024\276%\016$>wvX=\236W\203>\204\220\034>rX\216\276\367\322\207=\326\206\210=\200\001L\275\206\367\030\276l_\360\275<\354\031\275\3074r=y]l=\r\310\306=\212-\010\276\266\370o=,\303\313\274\254{\215\273\014f\274=\366\177<\273\020\220\251<>\006\216<\317\311\205\275>\306\324\275\327\370\001>\215\352\344\275\311>\202\276D\206\200=B%I>K<\257\275F\333\007=\362\274\250\275\325\023\036\276C\037U\275`\3440\275=\220\307=\377\305F>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
