node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3621617
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\367q\362=6\221\264\274\240\372U\276<\366q>\277\361\004\276-\352=\276Q\207t\276\312Lu>2\343S<\332s\220\275n\270\254\275\326\304\035=\343p\211=\336\236~>)2z;\242\201\261\275\\\210\n\273\321\014/=K\221\210\276\226U\021;\363Bd\275v\230\031\276\325\004\226\275W\2038\276\036\021\274=bSM\276\351\'\007>\266\211&\276\tH\355=\237\336\241=\035*\020\275\267s\232<\273\310\274<\213\275\r\276\253|I<\274}2\272^\270\005>!\313T>\313=\274\275\263N\022\276\260U\252\275\237\232<=qa\235\275T\257=>\216\274\027\276\355z\271=\224Yx\275\2422\261\274b\347\254\275\326\037h=@\025\n\276b\026r\276\017\243\230=\374\202\340=\322\025\332\275\224>\260=\207\201\207\275\252\347p>\373\362N;\273t\310\275\216\000\223=\306\337\344=\030\304f>%\205d=\275\216\035\276\245\214~\275S\t\257\273\326\033f\276\037yr<\3452\336=\206l\347\275\2344\022\276x\363\002\276+\\\213\275[l\201=\346\361\330\274O4l\271\022\220\344=\016\235\306=\031aH=,\231a\276\331\014P\276s\244\240=WA\2518\274\275r>\210|\035>p\252\'>\002vO\274\200Z\323\275\267\345\364\275\217\305\202<\t\017&\276\234(\204\275\210\346\241\275\311\260\254=nR\207\276g\026\003\276\330\302O\275k\276\275\275h \323=\r\313\343=\004\346\331<Y\035+\275W\030q>\252\213]\2743lM\276\005\334\274=\023B\004\276T\014\221\276\002\025\271\274\262\341\337==\177\375\275\304A\210>\214r\337=\310\366\226;\237\337G\273\034\274\004\276\313\371N\275\270\331\030\276\242\203\255\275\320\017\314\274\031\223\214\276\022\013\017=\320\257\362=,\004\355=\36605\276\256\346\\=\220%\031> \276j>\313\256s=\277\274\363=\212\373:\276K5\000>5(\217=\353\353H\276tq\246=\363\020\031\274\302\211\210\273x\010L>\253\007\254\273%J2\276\240\0061\275\306\320A\276\265;\274<\rU\324=\366\324\237\275\204KK=y\243\326<\225\031\034>\010\030\004\276P\214\361=!\261\341=\231@\005>Q:]\276M\033\222>+\0105\276\202\356\021>2\241\n\276YqH=\307Q\354=R\3617\275s\347\313\275\265*\025\276\357\204\r\276|\272\346\275~\003\205=\256\324\372;=\231/\275\355\341V>5\251\207\274\014\2200>~\032\370=\324\235\\>\266\201\272\275\026!w\275\323\036l\274\264\200D\275\311\330\255\275H\275\321=E\256\241=#\255\256=\016\301\211<\334\234a>Rzg=9\340\325=s\302h\275&N\324\275\203\030)<\006\210\002\276\001\033\267=\353\255\332\274\032\310e\275u[\025>\023\330\332=\373\000F=OB\204\275\230P\027\2763;\241\276\214L\301=\360\005Q\276\263\232p>\002 \364\274\2605\353<_>B\276\236\235V\276\213Cf=\014\r\241>o\231\376\275X\350\256\273\372\347|\275\210\272\010\276\365.\245=6\337\025\275\332x#\276\344g\037=\272\006\341\274\244I\205\274\351;:\275\346\257N=\223\347\315\275\017\200\007>\251\373\327<\025\274\337\274\330g\t\276\244\303u>\006\341+\275\300!\350=\235\021E>\311\010L>\222%\244;\357v\220=\322*F\276\035\306-=zr+>~\226\212=\355\260[\276\227\253\007\273u2\000\275.\035K\276Q\"\006\275\367\024\376\275\205\025\216=](\206=\'K\023>\"3\025=\255\257I=\221\302\032=\361\342\034\275\364Q\017\276\337\004E\276LG]>\361\335\232\2753\027\260\274\321\367*>\224\007\026>\253o\361=\254\203\345\275#\330\014\276\274\244\242\276.8o>B\227t\275\374\322\251\275\352\204\254\274wVM\276\262D\210\275y\020P>\227^\217=tu%=\310\256]\275\013N\343\275\372\213\003>\353\264\310=\325l\356\275\354\263f=\020\236\335=\200\233\241\275\322\264\200\274\3057t;\\\376\276\275\"W\210\275\003\226I<l\034\014\276y\r]\276I\003\340\274\233\251\354\275J\001:\276\241\347s\275\371]\203\274\215\252\177\273\304\343`>\274\342\247=\217w\027\275:K\017\276T/I\276\260/\251>\257\255\305=\020:\202<t\207\220\275\036V\006>-H\036>\234\254\243\275\336\365\275\275[&\001\276\237T\004<\236\3106\276\254n\031>ke,\275\010(\357=\365#\250\274\"It=\313q\300\275\364\007\327\275\332\376F>\205\315_<\325\023:\276f3K>\344\300$>\304S\311\274\225\276\017\276\253\256C\276&\302{>\3305o<\265\335\355=\013\000$\276\310\235S>\372\263\246>\026\034\203\276\264p.<\3003\343\275!\027<\274\036\2646\274\270\340\221=\332X\205\275\344\274h=K\335\000>\361\357j\275\034\331|\274 m/\276\371,x=\200\247\321=\nB\353=A\001Y\272*G7;\226k\275\275\r<\362;\201\235\201>\310\360\372<\375[\320=\251z\263\275\303\372\276=\207\203\241\275\006\260\237\274\222\350\r>\311\331\355\274X\206\010>sI1>\2339i\276kc\237=_\334+\276\337\024\241\275\232\227\305=\372Q\027\276^2\'\276\327x\374\275%\365\305<\321\005\n\276\021\262\245=X\360\025=\361\3670\276\r\227;\275\304\303\210\275\354:\035>\\\316.\2757Y>\274\364t\016\276\020\373\251< \360\005\275\3375C\276N\3413\276\t\345\360=\022\024\325=X\237 >\271\001\246=@g.>\256\312,\276n\211\246<\332\226\326=\271U\201\276]\t\t\276\036\036!\276kb\203>\361(\314\275FbH\276a>\207=\336\333\357\275uH!\276\2760F>\"\257Z\275|~(>4\000$>\314\304\262=f\003\200\275\213\273\t>\221\316I>\213SI\276$\024H=4\323\250=}SJ=%\373\007\275\217\303\367\274A\034\313=L7#=\303\336P>\334E->H\000\364;\203\271\003\276o:\246\2752\225\341\274b\304;>\'<\304=\240\235s\275\353\017\204=\224>g\275\026R\000=\202Ii\275\335\341\206\2752\014\250>\200\nY>w\314J>\253\255H\275?\337\367\275\013\300\311=\007\364\316\275\020\024l>=\210N>\231\270D\275\356\037\265=\251\246\035\275\311]\300=s\rV\275^\013V\275\365r\350\275\261\031\257>\213\"\376=\255\356\303\275w1\301:\324\353\272=\217\0021=\215Ax\275:\233\007>Q\300\342=O\315\t\276$S9>{(\361<\336\262\224=\340o\344=\2327\037\275\\\3370\276y\374\023>\342sZ\276\375a\200\275\320\250\001={W\362\274\303=r=S:\217\275cj(>f\232\031\276\235c\372<^\267\002;\2074\256=\265\315\253>\242\335\000<\001\270\363\274G`\250;8|I>\253)\201\275\021\245\312\275\237>\244<\036N\351\275\236\023\376\275]:-\275\255\013\333\275\377\356\014>G\366\333=\262\370.\276\267\333\311\272:G\302=v\037\212>:]D\276M\025\000\276s@\300=\230\215+\276\272tI\275\016Yv\276\220$\251>et\263\273\366\205\220<\332\340\326<tE(>`f\226<\214A4=\035\366\005>\036\021\243\274/\345\335;\265\214T<5P\210<\234\3250\276\310\010\035\276Y\032B>f\220\032\276\262~Y\275\205X\246<\357F\243<\031\367\343=X\t\352\274Q\215\202:*\230\365\275\2345\352<\024\005\321=&\226\324=\240\265\'\276:\020\000\274W\362\306=\244M\372<`\222\345<\235\020?\276U\032S\276\322\031K>\341\245\003=\223E1>\254\001\021=\2114\003\276\006^T>\231l\205\2758\303\253\275t&\004\276\034U\220\275\377\333\225>\233\302\265=\231\312\\\274q\\(\275\207(q=\302G\333\275\362\306u\276gv\014=\246h\351\274\317\"\017\276\337\2115>\341\323\314=G\333\224>O\014\016\276\374\"Y\2765\3709=\306=\211<o\213\">;\341\303\275\271\373d\276]\377\242\274Zd\331\275\'\232\323=\355\3070\276\253\243\277=m\t\353<1\212b\276p\353\326\274\342\345j\274\374\267\213\276\325\324\365=\303\240\276:-=\215\275\251v1\276\032\"\246\273\341\366\310\274\312\243\006>\376|\314\275\251\260\225\275\240\211\203<>_\000>e\2452\276\234\367\345=\234\237\r>0/\025>\332\357\214=[\270\354=\0067\263\275\374/\205=\263I\376<j\'\216\275\325\336\212>\203~\035\274\200\303\260>\201\345\204<\303\264Z\275\265\206\267=@q\241=\002Q\240\275\213\261\245\275%\322<\274\357\314\306<\303\317c<\335\n!\276\005v\253=\371S\010\275+I\002\275\211\360\247\276)\3721\276\225W\333\274\302\234\231\276P\035\250<\227_\033>\303\300\023\276V\\q\275H\276+=\346~\005\276\272Xj=*\035j=\271\234{\274TQ\341\275\344\314H\2764\234p=\220\310\203\275\002.\225\275k\215 \276X2Z>K\035\002\276\354\201\357=\022\373\027\276D!<\276\275\"\247\274|\377\366<\2055\014>\336I\367=\366\327o>^o\263\276\377}\272\275\000\265\360\274\021$\017\276\270\177\247=}rI>F`\220\274\017\352>\276\334\207\331=\321\030\231\274!j\314<\244O\177=Y\'\022>\272\371\264<\273\014\227<\233\010 >\036F =\245A\231<E\273\315\275#\021\225\275J;\306\275\225d\002=v\352!\274O/\305\273>/\216;_\007\200\275\tX2>\321\244\246\273\321\353\205\273\372\037\016\276i?\311\275)\366\270\275r\366\205>R{\263=Z\307/\275\3415\244=\236\343\323=\014\006\253\275\376T\273\275\321!\017\275\001.\201\276|\304\351\275\204\376|\274\231\000\234\275Q\2560\275\251\370\237<h\373\316=\270\252\350\274.9\241<[\370\372=\333q\276\275\340\232\226=h\305?\275\250\027\377<<(\242\276K\343\027\274\241N\t>\"s\311\275KM\324=%\002\"\275(\246\317=\033\226\203>Yh\265<W\304\202>\361\n\371==M\017>\347p\222\276g\223g\275\307\274\225\276J{\216\275GH\016>I\350\214>]\325\215\275\227\247~=\364\\\025\276\335\211M=\373\204\021>\361\303\313=\n\342\262\275\252\032\024<2(\276\275W\257\254\275pYm\274\315\002M\274\3657\000\276\342\316\003>L\254\004\276\370.\247=+\367\346\275XN\300=\375\363\036\275g-\372<L\2577>\252\203\022\276\336\247\037>\2334>>*\267G\275U\274\360<\245\327\007>\373\224\013>8\302d<y\004\006=\010\020<>CQ\222;\253*O>\274\000\022\275\273(F>R^\004\276\345n\010=\013\234q=\237e\004>\324\243\001\275\351\377\227\274\340s\"\275VP!\276\313\346\017>9g\005\276\025\315\317;W\217\302\275;s\301<\312\271Y\276\363g\227\276B\355&>\005!\243<8\206:>\245\272P=\224I\013\276L\250\203>\346\347;=0\360\365\274\211&g\274\017a\356=\233\021\361\275\246\220\t=xO~>j\031w\274f\002><W\370\354\272\374xJ=\260\354T>\215#\351\275\224dV>\242C\003>\324\345\332\275\341\356\211\276\032\304\321\275\013\260\211\275~\226\303\276\356\037@>v\310\027\276\364\226\271\275\251\032\026\276\241G@\2763\375K\275\270\300)>l\264\321\275\224\212,=\377\307G>\311\304h;\3602\263\275\201\030\230\275F\265\026\275\337\200_>\273\376T<\377H\331<\022\251\231\275\030]D=\301\353\201\275\002\255>\276\241a$>}\302f>f\3334=\335\312U:\333\030^>\035\315M=2(\">h\357\201\275\227\231\177\275\351V+\275\214\037\221\274\202\004h>\'\304\210\275\017Bg\276>\213\022>9\233\016\274<\237=\275\245\222J\274U\007\256\274F\306\261=>\002\277\274\3617{\276\330`\370=\022ua\275\362\021\200\273\260\334P=\377)@>gy\236\274\231\272\006\276ckf\275\202d*\275k]+>\236}\t\276\300iM=\321\212\320\2754  \276Z\031Y\275\230#\002\276\264\262_\275[\324%;\355\031$>\203\315\315\275\257dS\275\316I\310=\025}\010\276\207\310\\>\337GN>\224\020\250<#\317(=\017\216\205=\252\002>\276\207G\222\275\323\006x\276\360\250&>\037:\007\276O\245\301\276R\224\362=\365\363B=\344A&=\267h\216>\230\2554>\355\365\321;3Y\264=\205:\'\275\343\236\216=\005\r\023<m\234\267\275.\243\311\275\221\211\320\274\377N\221\275\263\230\232=\264\024\233\275\036\266\003=\305\242B\276\005\237S\276\3732\243={\351)\276\rN\037\276<p,\276\n\014\274<\356\2343\274\371\201\033>1/\331\275\026,V=\203\036\025\276\203\275\336=\232\227\227\275i\353\n\276\375\"\r\275e\322\370\275\207\356\251\275\341\301\232\275@\301n\275\226tJ>\272\273\322=\307N\036=~wx\275R\024/>\235d\251\275\033n\224\276d\365\255\274\210\002\026\2764\355\035\276_H\262=\316aL\275\232\212\216\275j4d\276\261O\005\273Q$\342\275\247\242M>Q\200D=c\374\304\275\245\211\345=*tZ=\315\3226=\347\271O\275\016(t>^\361\302\275{\366\277=~\210,\275\332\344U\275\303\324\036\276%)<\275\260u\242<\307\272y>3\301\251\274\356\014V>@\275\233<#\321u\275k\307%=\361X\302<9c*=\341\343F\276\203\360G=\026|\367\275\257G\254\275\370\377\033\275y\376\235;:\306\341\275\217\363N=\366\\3\276xL2>\216\010b\276\343\354\266;\367\266\000=\036\306\255\27675j>\337\'\026=\024\t\235<\335\002\301=v\246\205=@\262\221;\271\020\014>[\001\231>\262\343\005\275Y\016\272\275n\271B<\257\t\302\275\352o\004\276\324\206|\275\212\312\031\276\034\363\300<\212\343\025>)\204N\275aP\354\275\370\332\004\276\357vL>~\251\244\275\t\276\031\275\266pb\276\017t\324>\355\367\027\276X%2>\rP\034\274\003\322\n\274\200\214\334=2z/=3Z\241<\334\253\264\275&\313S>\222\020Y>\243\"2\275\312\356\346\275\201\004\255=\374\301\000>H^V\275K7\027\276\343\270a=e\323!>E6v\275\t)\002<\020\256\031=`\273\311\275\221\324\212=\240\020\027>\307\200u\276u\341\352\2755(,\275\236q\363\275\020\276\364\274i\352\001\276F\374\216=\305{\235=7\262 \276\0174\\\276\314\200;\275\242\276\322;@#<\276\003\027!\276a\030h\275dX}\273eF\010>Od\350\274(CE=\232!\304\275\r\375\347=\364\035\240\275\230\335R>\351C\242\275\303\350\036\275\376\264\271\275+z\246\275\026?7=\265u4\276\021B\031\276\375\206\237\275\035\330\027>\370R\305=\234e}=@\235\356=\261\346\024\276+\264A> %2>\020\356b\275\236\307\312<2@~\274@\322\267=\251\343~\276\'\277\201>\013\177\247=v\204\336=m\314\242>,\314\202=\227\310Q>\272\212\230\275_&F=|j\232\275\207\374R<\222A7\2760<<>\275Bi=\300>(\273\223L\027=f}\231=\310!&>\021;0>\032|\376\275\323\022\332=9\325\375=\227\372\302<\306\016\220\276\301X\334=\354\263H=D%\341\275\253\345\265\275\025\373R\275>\264v\275y*\233=\032\203\241\274\253\272\033\276\304\265S>\014\374\356\275W\251#=\352&*\275/\335\232=3-Y\2758{\202>\340\351\235=\236\344j\275,\2059<8\244\206=\025#\034\276BM\324\275G\374\376=\021w-\276_;h=j\242\\>\2763_\276+r\245\275!\231\214\275\362\253\321\275+\014k\275\036\213\340=\2561:\275\212y\255\275\275\263\203\2748Z\340\2740\353\352\274\212y\031=\223\356\364=\352\201\243\276-\304\260<\030\332\224<w\324\266>V\243\360=?\236\017=nI@\274\366\223\341\274+w\265= D8\276\037a\310=O\367\367;\276]\306;\n\366#=\231\207\013>\267\304*<5\221$>\371\021j\276<Q=>\306~g\274\302?\343=\312\013\243\276\t\225\220\276\nt@\274\021\225\025\273\024\016Y\276\0105\214\274;y\226\275M\203\255<\306\014\030\276\235\336W9\316=T=\317\337\312\275\013\340\257\2757IH=\3250\245=T\n\177=\022}!\276\331\336\005>\254\245\353=6\360\252\275\361+\273<\335w\247=\006\337#=-\311\300\275\343\3036>I\303\027>\204y^\2754\t\200>_\177\016=\344\232`\275\204\210>\275\006</>:\271C\271\366x\303=^\223\316\275\226\313\220=+\2769\275\030H\006\275\237C\n=8\254q\276\275$\010>\237\3730\276\234\376\316\275\242-J\274\207\000g\273\365\323\375\275\0046\230=\3209\202=z\270\325=\336\237\334\275-\031L=\203h\032>W\r\325\275b\3163\276\357\331\261=\2166\022>\005\0019>\036\375X=\312\n\363\275\256/\354=M\275&>C\274\341=\355\276u=\240\000\\\275:\241\222\276c\026\304=\301\271\006\276\372\221@\276\033W\"\276\2022\202\275\320e\007\275\2361D>\210z\336<\250|\301\276\340~\350\275\233\274\"\276\376\343\222\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
